maxint-rd/arduino_core_ch32/boards.txt
##############################################################################
##CH32VM00X_EVT Board   including V/M 002 004 005 006 007

CH32VM00X_EVT.name=CH32VM00X
CH32VM00X_EVT.build.core=arduino
CH32VM00X_EVT.build.board=CH32VM00X_EVT
CH32VM00X_EVT.upload.maximum_size=0
CH32VM00X_EVT.upload.maximum_data_size=0
CH32VM00X_EVT.build.variant_h=variant_{build.board}.h
CH32VM00X_EVT.debug.tool=gdb-WCH_LinkE


#CH32V002F4 TSSOP20 Board
CH32VM00X_EVT.menu.pnum.CH32V002F4=CH32V002F4 TSSOP20
CH32VM00X_EVT.menu.pnum.CH32V002F4.node=NODE_V002F4
CH32VM00X_EVT.menu.pnum.CH32V002F4.upload.maximum_size=16384
CH32VM00X_EVT.menu.pnum.CH32V002F4.upload.maximum_data_size=4096
CH32VM00X_EVT.menu.pnum.CH32V002F4.build.mcu=QingKe-V2C
CH32VM00X_EVT.menu.pnum.CH32V002F4.build.board=CH32V002F4
CH32VM00X_EVT.menu.pnum.CH32V002F4.build.series=CH32VM00X
CH32VM00X_EVT.menu.pnum.CH32V002F4.build.variant=CH32VM00X/CH32V002F4
CH32VM00X_EVT.menu.pnum.CH32V002F4.build.chip=CH32V002F4
CH32VM00X_EVT.menu.pnum.CH32V002F4.build.march=rv32ecxw
CH32VM00X_EVT.menu.pnum.CH32V002F4.build.mabi=ilp32e
CH32VM00X_EVT.menu.pnum.CH32V002F4.build.math_lib_gcc=-lm
CH32VM00X_EVT.menu.pnum.CH32V002F4.build.IQ_math_RV32=
CH32VM00X_EVT.menu.pnum.CH32V002F4.build.ch_extra_lib=-lprintf
CH32VM00X_EVT.menu.pnum.CH32V002F4.build.ldscript=LinkV002.ld

#CH32V002D4 QFN12 Board
CH32VM00X_EVT.menu.pnum.CH32V002D4=CH32V002D4 QFN12
CH32VM00X_EVT.menu.pnum.CH32V002D4.node=NODE_V002D4
CH32VM00X_EVT.menu.pnum.CH32V002D4.upload.maximum_size=16384
CH32VM00X_EVT.menu.pnum.CH32V002D4.upload.maximum_data_size=4096
CH32VM00X_EVT.menu.pnum.CH32V002D4.build.mcu=QingKe-V2C
CH32VM00X_EVT.menu.pnum.CH32V002D4.build.board=CH32V002D4
CH32VM00X_EVT.menu.pnum.CH32V002D4.build.series=CH32VM00X
CH32VM00X_EVT.menu.pnum.CH32V002D4.build.variant=CH32VM00X/CH32V002D4
CH32VM00X_EVT.menu.pnum.CH32V002D4.build.chip=CH32V002D4
CH32VM00X_EVT.menu.pnum.CH32V002D4.build.march=rv32ecxw
CH32VM00X_EVT.menu.pnum.CH32V002D4.build.mabi=ilp32e
CH32VM00X_EVT.menu.pnum.CH32V002D4.build.math_lib_gcc=-lm
CH32VM00X_EVT.menu.pnum.CH32V002D4.build.IQ_math_RV32=
CH32VM00X_EVT.menu.pnum.CH32V002D4.build.ch_extra_lib=-lprintf
CH32VM00X_EVT.menu.pnum.CH32V002D4.build.ldscript=LinkV002.ld

#CH32V006K8 QFN32 EVT Board
CH32VM00X_EVT.menu.pnum.CH32V006K8=CH32V006K8 QFN32 EVT
CH32VM00X_EVT.menu.pnum.CH32V006K8.node=NODE_V006K8
CH32VM00X_EVT.menu.pnum.CH32V006K8.upload.maximum_size=63488
CH32VM00X_EVT.menu.pnum.CH32V006K8.upload.maximum_data_size=8192
CH32VM00X_EVT.menu.pnum.CH32V006K8.build.mcu=QingKe-V2C
CH32VM00X_EVT.menu.pnum.CH32V006K8.build.board=CH32V006K8
CH32VM00X_EVT.menu.pnum.CH32V006K8.build.series=CH32VM00X
CH32VM00X_EVT.menu.pnum.CH32V006K8.build.variant=CH32VM00X/CH32V006K8
CH32VM00X_EVT.menu.pnum.CH32V006K8.build.chip=CH32V006K8
CH32VM00X_EVT.menu.pnum.CH32V006K8.build.march=rv32ecxw
CH32VM00X_EVT.menu.pnum.CH32V006K8.build.mabi=ilp32e
CH32VM00X_EVT.menu.pnum.CH32V006K8.build.math_lib_gcc=-lm
CH32VM00X_EVT.menu.pnum.CH32V006K8.build.IQ_math_RV32=
CH32VM00X_EVT.menu.pnum.CH32V006K8.build.ch_extra_lib=-lprintf
CH32VM00X_EVT.menu.pnum.CH32V006K8.build.ldscript=Link.ld

#CH32V006F8 QFN20/TSSOP20 Board
CH32VM00X_EVT.menu.pnum.CH32V006F8=CH32V006F8 TSSOP20/QFN20
CH32VM00X_EVT.menu.pnum.CH32V006F8.node=NODE_V006F8
CH32VM00X_EVT.menu.pnum.CH32V006F8.upload.maximum_size=63488
CH32VM00X_EVT.menu.pnum.CH32V006F8.upload.maximum_data_size=8192
CH32VM00X_EVT.menu.pnum.CH32V006F8.build.mcu=QingKe-V2C
CH32VM00X_EVT.menu.pnum.CH32V006F8.build.board=CH32V006F8
CH32VM00X_EVT.menu.pnum.CH32V006F8.build.series=CH32VM00X
CH32VM00X_EVT.menu.pnum.CH32V006F8.build.variant=CH32VM00X/CH32V006F8
CH32VM00X_EVT.menu.pnum.CH32V006F8.build.chip=CH32V006F8
CH32VM00X_EVT.menu.pnum.CH32V006F8.build.march=rv32ecxw
CH32VM00X_EVT.menu.pnum.CH32V006F8.build.mabi=ilp32e
CH32VM00X_EVT.menu.pnum.CH32V006F8.build.math_lib_gcc=-lm
CH32VM00X_EVT.menu.pnum.CH32V006F8.build.IQ_math_RV32=
CH32VM00X_EVT.menu.pnum.CH32V006F8.build.ch_extra_lib=-lprintf
CH32VM00X_EVT.menu.pnum.CH32V006F8.build.ldscript=Link.ld

#CH32V006E8 QSOP24 Board
CH32VM00X_EVT.menu.pnum.CH32V006E8=CH32V006E8 QSOP24
CH32VM00X_EVT.menu.pnum.CH32V006E8.node=NODE_V006E8
CH32VM00X_EVT.menu.pnum.CH32V006E8.upload.maximum_size=63488
CH32VM00X_EVT.menu.pnum.CH32V006E8.upload.maximum_data_size=8192
CH32VM00X_EVT.menu.pnum.CH32V006E8.build.mcu=QingKe-V2C
CH32VM00X_EVT.menu.pnum.CH32V006E8.build.board=CH32V006E8
CH32VM00X_EVT.menu.pnum.CH32V006E8.build.series=CH32VM00X
CH32VM00X_EVT.menu.pnum.CH32V006E8.build.variant=CH32VM00X/CH32V006E8
CH32VM00X_EVT.menu.pnum.CH32V006E8.build.chip=CH32V006E8
CH32VM00X_EVT.menu.pnum.CH32V006E8.build.march=rv32ecxw
CH32VM00X_EVT.menu.pnum.CH32V006E8.build.mabi=ilp32e
CH32VM00X_EVT.menu.pnum.CH32V006E8.build.math_lib_gcc=-lm
CH32VM00X_EVT.menu.pnum.CH32V006E8.build.IQ_math_RV32=
CH32VM00X_EVT.menu.pnum.CH32V006E8.build.ch_extra_lib=-lprintf
CH32VM00X_EVT.menu.pnum.CH32V006E8.build.ldscript=Link.ld


# Upload menu
CH32VM00X_EVT.menu.upload_method.swdMethod=WCH-SWD
CH32VM00X_EVT.menu.upload_method.swdMethod.upload.protocol=
CH32VM00X_EVT.menu.upload_method.swdMethod.upload.options=
CH32VM00X_EVT.menu.upload_method.swdMethod.upload.tool=WCH_linkE
CH32VM00X_EVT.menu.upload_method.ispMethod=WCH-ISP
CH32VM00X_EVT.menu.upload_method.ispMethod.upload.protocol=
CH32VM00X_EVT.menu.upload_method.ispMethod.upload.options=
CH32VM00X_EVT.menu.upload_method.ispMethod.upload.tool=wchisp


# Peripherals Options
CH32VM00X_EVT.menu.periADC.disable=disabled (default)
CH32VM00X_EVT.menu.periADC.disable.build.periADC=
CH32VM00X_EVT.menu.periADC.enable=enabled
CH32VM00X_EVT.menu.periADC.enable.build.periADC=-DADC_MODULE_ENABLED
CH32VM00X_EVT.menu.periUART.disable=disabled (default)
CH32VM00X_EVT.menu.periUART.disable.build.periUART=
CH32VM00X_EVT.menu.periUART.enable=enabled
CH32VM00X_EVT.menu.periUART.enable.build.periUART=-DUART_MODULE_ENABLED
CH32VM00X_EVT.menu.periSPI.disable=disabled (default)
CH32VM00X_EVT.menu.periSPI.disable.build.periSPI=
CH32VM00X_EVT.menu.periSPI.enable=enabled
CH32VM00X_EVT.menu.periSPI.enable.build.periSPI=-DSPI_MODULE_ENABLED
CH32VM00X_EVT.menu.periI2C.disable=disabled (default)
CH32VM00X_EVT.menu.periI2C.disable.build.periI2C=
CH32VM00X_EVT.menu.periI2C.enable=enabled
CH32VM00X_EVT.menu.periI2C.enable.build.periI2C=-DI2C_MODULE_ENABLED
CH32VM00X_EVT.menu.periI2Cslave.disable=disabled (default)
CH32VM00X_EVT.menu.periI2Cslave.disable.build.periI2Cslave=-DOPT_I2C_SLAVE=0
CH32VM00X_EVT.menu.periI2Cslave.enable=enabled
CH32VM00X_EVT.menu.periI2Cslave.enable.build.periI2Cslave=-DOPT_I2C_SLAVE=1
CH32VM00X_EVT.menu.periTimer.disable=disabled (default)
CH32VM00X_EVT.menu.periTimer.disable.build.periTimer=
CH32VM00X_EVT.menu.periTimer.enable=enabled
CH32VM00X_EVT.menu.periTimer.enable.build.periTimer=-DTIM_MODULE_ENABLED


# Clock Select
CH32VM00X_EVT.menu.clock.48MHz_HSI=48MHz Internal
CH32VM00X_EVT.menu.clock.48MHz_HSI.build.flags.clock=-DSYSCLK_FREQ_48MHz_HSI=48000000 -DF_CPU=48000000
CH32VM00X_EVT.menu.clock.24MHz_HSI=24MHz Internal
CH32VM00X_EVT.menu.clock.24MHz_HSI.build.flags.clock=-DSYSCLK_FREQ_24MHz_HSI=24000000 -DF_CPU=24000000
CH32VM00X_EVT.menu.clock.8MHz_HSI=8MHz Internal
CH32VM00X_EVT.menu.clock.8MHz_HSI.build.flags.clock=-DSYSCLK_FREQ_8MHz_HSI=8000000 -DF_CPU=8000000
CH32VM00X_EVT.menu.clock.48MHz_HSE=48MHz External
CH32VM00X_EVT.menu.clock.48MHz_HSE.build.flags.clock=-DSYSCLK_FREQ_48MHz_HSE=48000000 -DF_CPU=48000000
CH32VM00X_EVT.menu.clock.24MHz_HSE=24MHz External
CH32VM00X_EVT.menu.clock.24MHz_HSE.build.flags.clock=-DSYSCLK_FREQ_24MHz_HSE=24000000 -DF_CPU=24000000
CH32VM00X_EVT.menu.clock.8MHz_HSE=8MHz External
CH32VM00X_EVT.menu.clock.8MHz_HSE.build.flags.clock=-DSYSCLK_FREQ_8MHz_HSE=8000000 -DF_CPU=8000000


